Dlubal.RFEM5.INotify
Interface for client notification

Dlubal.RFEM5.INotify.CalculationStatus(System.String@)
Returns current calculation status.
Status: String object describing current calculation status.

Dlubal.RFEM5.INotify.CalculationFinished(System.UInt32)
Indicates that the calculation has been finished.
Errors: Array of errors that occurred during the calculation.

Dlubal.RFEM5.INotify.Question(System.UInt32@)
Called when user interaction is needed.
Returns: Information if the result of the question is positive or negative.
Question: Question for the user.